tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridgeEspUsbHost.h
#pragma once

#include <ESP32KeyBridge.h>
#include <EspUsbHost.h>

#include <string.h>

// USB Host input adapters backed by the EspUsbHost library.
//
// Ownership model: the sketch owns the EspUsbHost stack and starts it with
// the library's own configuration (port selection, etc.). Adapters take a
// reference and subscribe to events lazily on their first update(), so they
// have no begin() and no ordering against the bridge or the stack.
//
// EspUsbHost callbacks are single-slot (each on*() call replaces the
// previous callback) and fire from the library's internal task. The
// adapters therefore share one subscription per hook through an internal
// hub and hand the data to the update() context behind a critical section.
// Sketches must not set the hooks the adapters use themselves
// (onKeyboardState, onConsumerControl, onMouse, onGamepad, onMidiMessage,
// onDeviceDisconnected). The per-event onKeyboard hook stays free for
// sketches.

namespace esp32keybridge
{

namespace detail
{

// One hub per EspUsbHost stack: owns the single-slot callbacks and fans
// events out to the adapters registered on that stack.
class EspUsbHostHub
{
public:
  static constexpr size_t MaxStacks = 2; // ESP32-P4 can host on HS and FS
  static constexpr size_t MaxDisconnectSinks = 4;

  using KeyboardStateSink = void (*)(void *context, const EspUsbHostKeyboardState &state);
  using ConsumerSink = void (*)(void *context, const EspUsbHostConsumerControlEvent &event);
  using MouseSink = void (*)(void *context, const EspUsbHostMouseEvent &event);
  using GamepadSink = void (*)(void *context, const EspUsbHostGamepadEvent &event);
  using MidiSink = void (*)(void *context, const EspUsbHostMidiMessage &message);
  using DisconnectSink = void (*)(void *context, uint8_t address);

  static EspUsbHostHub &forStack(EspUsbHost &usb)
  {
    static EspUsbHostHub hubs[MaxStacks];
    for (size_t i = 0; i < MaxStacks; ++i)
    {
      if (hubs[i].stack_ == &usb)
      {
        return hubs[i];
      }
    }
    for (size_t i = 0; i < MaxStacks; ++i)
    {
      if (hubs[i].stack_ == nullptr)
      {
        hubs[i].bind(usb);
        return hubs[i];
      }
    }
    return hubs[0]; // more stacks than MaxStacks; unreachable on real chips
  }

  void setKeyboardStateSink(KeyboardStateSink sink, void *context)
  {
    keyboardContext_ = context;
    keyboardSink_ = sink;
  }

  void setConsumerSink(ConsumerSink sink, void *context)
  {
    consumerContext_ = context;
    consumerSink_ = sink;
  }

  void setMouseSink(MouseSink sink, void *context)
  {
    mouseContext_ = context;
    mouseSink_ = sink;
  }

  void setGamepadSink(GamepadSink sink, void *context)
  {
    gamepadContext_ = context;
    gamepadSink_ = sink;
  }

  void setMidiSink(MidiSink sink, void *context)
  {
    midiContext_ = context;
    midiSink_ = sink;
  }

  void addDisconnectSink(DisconnectSink sink, void *context)
  {
    for (size_t i = 0; i < MaxDisconnectSinks; ++i)
    {
      if (disconnectSinks_[i] == nullptr)
      {
        disconnectContexts_[i] = context;
        disconnectSinks_[i] = sink;
        return;
      }
    }
  }

private:
  void bind(EspUsbHost &usb)
  {
    stack_ = &usb;
    usb.onKeyboardState(
        [this](const EspUsbHostKeyboardState &state)
        {
          if (keyboardSink_ != nullptr)
          {
            keyboardSink_(keyboardContext_, state);
          }
        });
    usb.onConsumerControl(
        [this](const EspUsbHostConsumerControlEvent &event)
        {
          if (consumerSink_ != nullptr)
          {
            consumerSink_(consumerContext_, event);
          }
        });
    usb.onMouse(
        [this](const EspUsbHostMouseEvent &event)
        {
          if (mouseSink_ != nullptr)
          {
            mouseSink_(mouseContext_, event);
          }
        });
    usb.onGamepad(
        [this](const EspUsbHostGamepadEvent &event)
        {
          if (gamepadSink_ != nullptr)
          {
            gamepadSink_(gamepadContext_, event);
          }
        });
    usb.onMidiMessage(
        [this](const EspUsbHostMidiMessage &message)
        {
          if (midiSink_ != nullptr)
          {
            midiSink_(midiContext_, message);
          }
        });
    usb.onDeviceDisconnected(
        [this](const EspUsbHostDeviceInfo &info)
        {
          for (size_t i = 0; i < MaxDisconnectSinks; ++i)
          {
            if (disconnectSinks_[i] != nullptr)
            {
              disconnectSinks_[i](disconnectContexts_[i], info.address);
            }
          }
        });
  }

  EspUsbHost *stack_ = nullptr;
  KeyboardStateSink keyboardSink_ = nullptr;
  void *keyboardContext_ = nullptr;
  ConsumerSink consumerSink_ = nullptr;
  void *consumerContext_ = nullptr;
  MouseSink mouseSink_ = nullptr;
  void *mouseContext_ = nullptr;
  GamepadSink gamepadSink_ = nullptr;
  void *gamepadContext_ = nullptr;
  MidiSink midiSink_ = nullptr;
  void *midiContext_ = nullptr;
  DisconnectSink disconnectSinks_[MaxDisconnectSinks] = {};
  void *disconnectContexts_[MaxDisconnectSinks] = {};
};

} // namespace detail

// USB keyboard input (consumer keys included). All keyboards on the stack
// are merged (key union across devices); a disconnect releases only that
// device's keys. The bridge lock state is forwarded to every keyboard's
// LEDs.
//
// Keyboard state comes from onKeyboardState (EspUsbHost 2.2.0+): one
// format-independent 256-bit snapshot per changed report — boot, report-ID
// boot, and NKRO alike, modifier-only changes included — which maps
// directly onto the key set. Consumer keys (media keys on keyboards,
// remotes) arrive as onConsumerControl press/release events.
class EspUsbHostKeyboardInputAdapter : public InputAdapter
{
public:
  // Keyboard interfaces tracked simultaneously (per USB address +
  // interface); reports from further ones are ignored.
  static constexpr size_t MaxKeyboards = 4;
  // Simultaneously held consumer usages across all devices.
  static constexpr size_t MaxConsumerKeys = 8;

  explicit EspUsbHostKeyboardInputAdapter(EspUsbHost &usb) : usb_(usb) {}

  void update() override
  {
    if (!subscribed_)
    {
      subscribed_ = true;
      detail::EspUsbHostHub &hub = detail::EspUsbHostHub::forStack(usb_);
      hub.setKeyboardStateSink(&EspUsbHostKeyboardInputAdapter::handleKeyboardState, this);
      hub.setConsumerSink(&EspUsbHostKeyboardInputAdapter::handleConsumer, this);
      hub.addDisconnectSink(&EspUsbHostKeyboardInputAdapter::handleDisconnect, this);
    }

    // Snapshot the callback-fed state, then rebuild outside the lock.
    uint8_t bitmaps[MaxKeyboards][ESP_USB_HOST_KEYBOARD_BITMAP_SIZE];
    size_t keyboardCount;
    ConsumerEntry consumer[MaxConsumerKeys];
    size_t consumerCount;
    portENTER_CRITICAL(&mux_);
    keyboardCount = keyboardCount_;
    for (size_t i = 0; i < keyboardCount_; ++i)
    {
      memcpy(bitmaps[i], keyboards_[i].bitmap, ESP_USB_HOST_KEYBOARD_BITMAP_SIZE);
    }
    consumerCount = consumerCount_;
    for (size_t i = 0; i < consumerCount_; ++i)
    {
      consumer[i] = consumer_[i];
    }
    portEXIT_CRITICAL(&mux_);

