tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridgeEspUsbHost.h
    keys_.clear();
    for (size_t i = 0; i < keyboardCount; ++i)
    {
      for (size_t byte = 0; byte < ESP_USB_HOST_KEYBOARD_BITMAP_SIZE; ++byte)
      {
        uint8_t bits = bitmaps[i][byte];
        while (bits != 0)
        {
          const int bit = __builtin_ctz(bits);
          bits = static_cast<uint8_t>(bits & (bits - 1));
          const uint16_t usage = static_cast<uint16_t>(byte * 8 + bit);
          // Usages 0x01-0x03 are boot rollover/POST error codes, not keys.
          if (usage >= 0x04)
          {
            keys_.press(keyboardKey(usage));
          }
        }
      }
    }
    for (size_t i = 0; i < consumerCount; ++i)
    {
      keys_.press(consumerKey(consumer[i].usage));
    }
    connected_ = keyboardCount > 0 || consumerCount > 0;
  }

  const KeySet &keys() const override { return keys_; }

  // A keyboard counts as present from its first changed report (EspUsbHost
  // has no enumeration query); false again when every known device
  // disconnected. A keyboard that never reported has no state to lose.
  bool connected() const override { return connected_; }

  // Forwards the bridge lock state to the LEDs of every keyboard on the
  // stack. EspUsbHost carries num/caps/scroll; kana is not forwardable.
  void setLockState(const LockState &state) override
  {
    usb_.setKeyboardLeds(state.numLock, state.capsLock, state.scrollLock);
  }

private:
  struct Keyboard
  {
    uint8_t address = 0;
    uint8_t interfaceNumber = 0;
    uint8_t bitmap[ESP_USB_HOST_KEYBOARD_BITMAP_SIZE] = {};
  };

  struct ConsumerEntry
  {
    uint8_t address = 0;
    uint16_t usage = 0;
  };

  // Fires from the EspUsbHost task.
  static void handleKeyboardState(void *context, const EspUsbHostKeyboardState &state)
  {
    EspUsbHostKeyboardInputAdapter &self = *static_cast<EspUsbHostKeyboardInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    size_t index = self.keyboardCount_;
    for (size_t i = 0; i < self.keyboardCount_; ++i)
    {
      if (self.keyboards_[i].address == state.address &&
          self.keyboards_[i].interfaceNumber == state.interfaceNumber)
      {
        index = i;
        break;
      }
    }
    if (index == self.keyboardCount_ && self.keyboardCount_ < MaxKeyboards)
    {
      self.keyboards_[self.keyboardCount_].address = state.address;
      self.keyboards_[self.keyboardCount_].interfaceNumber = state.interfaceNumber;
      ++self.keyboardCount_;
    }
    if (index < self.keyboardCount_)
    {
      memcpy(self.keyboards_[index].bitmap, state.keys, ESP_USB_HOST_KEYBOARD_BITMAP_SIZE);
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  // Fires from the EspUsbHost task.
  static void handleConsumer(void *context, const EspUsbHostConsumerControlEvent &event)
  {
    EspUsbHostKeyboardInputAdapter &self = *static_cast<EspUsbHostKeyboardInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    if (event.released)
    {
      for (size_t i = 0; i < self.consumerCount_; ++i)
      {
        if (self.consumer_[i].address == event.address && self.consumer_[i].usage == event.usage)
        {
          self.consumer_[i] = self.consumer_[self.consumerCount_ - 1];
          --self.consumerCount_;
          break;
        }
      }
    }
    if (event.pressed && event.usage != 0 && self.consumerCount_ < MaxConsumerKeys)
    {
      bool held = false;
      for (size_t i = 0; i < self.consumerCount_; ++i)
      {
        if (self.consumer_[i].address == event.address && self.consumer_[i].usage == event.usage)
        {
          held = true;
          break;
        }
      }
      if (!held)
      {
        self.consumer_[self.consumerCount_].address = event.address;
        self.consumer_[self.consumerCount_].usage = event.usage;
        ++self.consumerCount_;
      }
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  // Fires from the EspUsbHost task (any device, not only keyboards).
  static void handleDisconnect(void *context, uint8_t address)
  {
    EspUsbHostKeyboardInputAdapter &self = *static_cast<EspUsbHostKeyboardInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    for (size_t i = self.keyboardCount_; i > 0; --i)
    {
      if (self.keyboards_[i - 1].address == address)
      {
        self.keyboards_[i - 1] = self.keyboards_[self.keyboardCount_ - 1];
        --self.keyboardCount_;
      }
    }
    for (size_t i = self.consumerCount_; i > 0; --i)
    {
      if (self.consumer_[i - 1].address == address)
      {
        self.consumer_[i - 1] = self.consumer_[self.consumerCount_ - 1];
        --self.consumerCount_;
      }
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  EspUsbHost &usb_;
  bool subscribed_ = false;
  KeySet keys_;
  bool connected_ = false;
  portMUX_TYPE mux_ = portMUX_INITIALIZER_UNLOCKED;
  Keyboard keyboards_[MaxKeyboards];
  size_t keyboardCount_ = 0;
  ConsumerEntry consumer_[MaxConsumerKeys];
  size_t consumerCount_ = 0;
};

// USB mouse input. Buttons become MouseButton keys in keys(); movement and
// wheel accumulate as relative axis deltas. All mice on the stack are
// merged (buttons union, deltas summed); a disconnect releases that
// mouse's buttons only.
class EspUsbHostMouseInputAdapter : public InputAdapter
{
public:
  // Mice tracked simultaneously (per USB address); reports from further
  // addresses are ignored.
  static constexpr size_t MaxMice = 4;

  explicit EspUsbHostMouseInputAdapter(EspUsbHost &usb) : usb_(usb) {}

  void update() override
  {
    if (!subscribed_)
    {
      subscribed_ = true;
      detail::EspUsbHostHub &hub = detail::EspUsbHostHub::forStack(usb_);
      hub.setMouseSink(&EspUsbHostMouseInputAdapter::handleMouse, this);
      hub.addDisconnectSink(&EspUsbHostMouseInputAdapter::handleDisconnect, this);
    }

    // Snapshot the callback-fed state, then rebuild outside the lock.
    uint8_t buttons[MaxMice];
    size_t mouseCount;
    int32_t deltas[kAxisCount];
    portENTER_CRITICAL(&mux_);
    mouseCount = mouseCount_;
    for (size_t i = 0; i < mouseCount_; ++i)
    {
      buttons[i] = mice_[i].buttons;
    }
    for (size_t axis = 0; axis < kAxisCount; ++axis)
    {
      deltas[axis] = pendingAxis_[axis];
      pendingAxis_[axis] = 0;
    }
    portEXIT_CRITICAL(&mux_);

