tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridgeEspUsbHost.h
    keys_.clear();
    for (size_t i = 0; i < mouseCount; ++i)
    {
      for (size_t bit = 0; bit < 8; ++bit)
      {
        if ((buttons[i] & (1u << bit)) != 0)
        {
          keys_.press(mouseButtonKey(static_cast<uint16_t>(bit + 1)));
        }
      }
    }
    for (size_t axis = 0; axis < kAxisCount; ++axis)
    {
      axisDeltas_[axis] += deltas[axis];
    }
    connected_ = mouseCount > 0;
  }

  const KeySet &keys() const override { return keys_; }

  // A mouse counts as present from its first report (EspUsbHost has no
  // enumeration query); false again when every known mouse disconnected.
  // A mouse that never reported has no state to lose.
  bool connected() const override { return connected_; }

  int32_t takeAxisDelta(Axis axis) override
  {
    const size_t index = static_cast<size_t>(axis);
    const int32_t delta = axisDeltas_[index];
    axisDeltas_[index] = 0;
    return delta;
  }

private:
  struct Mouse
  {
    uint8_t address = 0;
    uint8_t buttons = 0;
  };

  // Fires from the EspUsbHost task.
  static void handleMouse(void *context, const EspUsbHostMouseEvent &event)
  {
    EspUsbHostMouseInputAdapter &self = *static_cast<EspUsbHostMouseInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    size_t index = self.mouseCount_;
    for (size_t i = 0; i < self.mouseCount_; ++i)
    {
      if (self.mice_[i].address == event.address)
      {
        index = i;
        break;
      }
    }
    if (index == self.mouseCount_ && self.mouseCount_ < MaxMice)
    {
      self.mice_[self.mouseCount_].address = event.address;
      self.mice_[self.mouseCount_].buttons = 0;
      ++self.mouseCount_;
    }
    if (index < self.mouseCount_)
    {
      self.mice_[index].buttons = event.buttons;
      self.pendingAxis_[static_cast<size_t>(Axis::X)] += event.x;
      self.pendingAxis_[static_cast<size_t>(Axis::Y)] += event.y;
      self.pendingAxis_[static_cast<size_t>(Axis::Wheel)] += event.wheel;
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  // Fires from the EspUsbHost task (any device, not only mice).
  static void handleDisconnect(void *context, uint8_t address)
  {
    EspUsbHostMouseInputAdapter &self = *static_cast<EspUsbHostMouseInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    for (size_t i = 0; i < self.mouseCount_; ++i)
    {
      if (self.mice_[i].address == address)
      {
        self.mice_[i] = self.mice_[self.mouseCount_ - 1];
        --self.mouseCount_;
        break;
      }
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  EspUsbHost &usb_;
  bool subscribed_ = false;
  KeySet keys_;
  bool connected_ = false;
  int32_t axisDeltas_[kAxisCount] = {};
  portMUX_TYPE mux_ = portMUX_INITIALIZER_UNLOCKED;
  Mouse mice_[MaxMice];
  size_t mouseCount_ = 0;
  int32_t pendingAxis_[kAxisCount] = {};
};

// USB gamepad input. Buttons and the hat/D-pad map to keys; only mapped
// controls produce output, so the sketch decides what each control means
// (any Key kind - keyboard, consumer, mouse button, or a virtual key to
// remap/layer later). All gamepads on the stack are merged; a disconnect
// drops only that pad's controls. Analog sticks and triggers are not mapped
// in this version.
//
// Reports arrive as onGamepad (EspUsbHost 2.3.0): decoded HID fields. Button
// page (0x09) fields are buttons (usage = HID button number, 1-based); the
// Generic Desktop hat switch (usage 0x39) is the D-pad. Button numbers vary
// by controller - watch a LogOutputAdapter to find which is which.
class EspUsbHostGamepadInputAdapter : public InputAdapter
{
public:
  static constexpr size_t MaxGamepads = 4;
  static constexpr size_t MaxButtons = 32;

  explicit EspUsbHostGamepadInputAdapter(EspUsbHost &usb) : usb_(usb) {}

  // Map HID button `number` (1-based, as the controller reports it) to any
  // Key. Returns false if the number is out of range; unmapped buttons
  // produce nothing.
  bool mapButton(uint8_t number, Key key)
  {
    if (number < 1 || number > MaxButtons)
    {
      return false;
    }
    buttonKeys_[number - 1] = key;
    return true;
  }

  // Map the four hat/D-pad directions; diagonals press the two neighbours.
  void mapHat(Key up, Key down, Key left, Key right)
  {
    hatUp_ = up;
    hatDown_ = down;
    hatLeft_ = left;
    hatRight_ = right;
  }

  void update() override
  {
    if (!subscribed_)
    {
      subscribed_ = true;
      detail::EspUsbHostHub &hub = detail::EspUsbHostHub::forStack(usb_);
      hub.setGamepadSink(&EspUsbHostGamepadInputAdapter::handleGamepad, this);
      hub.addDisconnectSink(&EspUsbHostGamepadInputAdapter::handleDisconnect, this);
    }

    uint32_t buttons[MaxGamepads];
    int8_t hats[MaxGamepads];
    size_t padCount;
    portENTER_CRITICAL(&mux_);
    padCount = padCount_;
    for (size_t i = 0; i < padCount_; ++i)
    {
      buttons[i] = pads_[i].buttons;
      hats[i] = pads_[i].hat;
    }
    portEXIT_CRITICAL(&mux_);

    keys_.clear();
    bool up = false, down = false, left = false, right = false;
    for (size_t i = 0; i < padCount; ++i)
    {
      for (size_t b = 0; b < MaxButtons; ++b)
      {
        if ((buttons[i] & (1u << b)) != 0 && isValid(buttonKeys_[b]))
        {
          keys_.press(buttonKeys_[b]);
        }
      }
      switch (hats[i])
      {
      case 0: up = true; break;
      case 1: up = true; right = true; break;
      case 2: right = true; break;
      case 3: down = true; right = true; break;
      case 4: down = true; break;
      case 5: down = true; left = true; break;
      case 6: left = true; break;
      case 7: up = true; left = true; break;
      default: break;
      }
    }
    if (up && isValid(hatUp_)) keys_.press(hatUp_);
    if (down && isValid(hatDown_)) keys_.press(hatDown_);
    if (left && isValid(hatLeft_)) keys_.press(hatLeft_);
    if (right && isValid(hatRight_)) keys_.press(hatRight_);
    connected_ = padCount > 0;
  }

  const KeySet &keys() const override { return keys_; }
  bool connected() const override { return connected_; }

