tanakamasayuki/ESP32KeyBridge/src/ESP32KeyBridgeEspUsbHost.h
private:
  struct Pad
  {
    uint8_t address = 0;
    uint8_t interfaceNumber = 0;
    uint32_t buttons = 0;
    int8_t hat = -1;
  };

  // Fires from the EspUsbHost task.
  static void handleGamepad(void *context, const EspUsbHostGamepadEvent &event)
  {
    EspUsbHostGamepadInputAdapter &self = *static_cast<EspUsbHostGamepadInputAdapter *>(context);
    uint32_t buttons = 0;
    int8_t hat = -1;
    for (size_t i = 0; i < event.fieldCount; ++i)
    {
      const EspUsbHostHIDFieldValue &field = event.fields[i];
      if (field.usagePage == 0x09) // Button page
      {
        if (field.usage >= 1 && field.usage <= MaxButtons && field.value != 0)
        {
          buttons |= (1u << (field.usage - 1));
        }
      }
      else if (field.usagePage == 0x01 && field.usage == 0x39) // Hat switch
      {
        // Hat encodings differ between controllers. Directions run clockwise
        // from up. A value outside the logical range is "centered". When the
        // logical range holds nine values (e.g. TinyUSB's 0..8), the first
        // one is an explicit "centered" and the eight directions follow;
        // otherwise the range is the eight directions (first = up).
        hat = -1;
        if (field.value >= field.logicalMin && field.value <= field.logicalMax)
        {
          const int32_t count = field.logicalMax - field.logicalMin + 1;
          const int32_t index = field.value - field.logicalMin;
          if (count >= 9)
          {
            if (index >= 1 && index <= 8)
            {
              hat = static_cast<int8_t>(index - 1);
            }
          }
          else if (index >= 0 && index <= 7)
          {
            hat = static_cast<int8_t>(index);
          }
        }
      }
    }

    portENTER_CRITICAL(&self.mux_);
    size_t index = self.padCount_;
    for (size_t i = 0; i < self.padCount_; ++i)
    {
      if (self.pads_[i].address == event.address &&
          self.pads_[i].interfaceNumber == event.interfaceNumber)
      {
        index = i;
        break;
      }
    }
    if (index == self.padCount_ && self.padCount_ < MaxGamepads)
    {
      self.pads_[self.padCount_].address = event.address;
      self.pads_[self.padCount_].interfaceNumber = event.interfaceNumber;
      ++self.padCount_;
    }
    if (index < self.padCount_)
    {
      self.pads_[index].buttons = buttons;
      self.pads_[index].hat = hat;
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  // Fires from the EspUsbHost task (any device, not only gamepads).
  static void handleDisconnect(void *context, uint8_t address)
  {
    EspUsbHostGamepadInputAdapter &self = *static_cast<EspUsbHostGamepadInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    for (size_t i = self.padCount_; i > 0; --i)
    {
      if (self.pads_[i - 1].address == address)
      {
        self.pads_[i - 1] = self.pads_[self.padCount_ - 1];
        --self.padCount_;
      }
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  EspUsbHost &usb_;
  bool subscribed_ = false;
  KeySet keys_;
  bool connected_ = false;
  Key buttonKeys_[MaxButtons] = {};
  Key hatUp_, hatDown_, hatLeft_, hatRight_;
  portMUX_TYPE mux_ = portMUX_INITIALIZER_UNLOCKED;
  Pad pads_[MaxGamepads];
  size_t padCount_ = 0;
};

// USB MIDI input. MIDI notes map to keys: Note On (velocity > 0) presses the
// mapped key, Note Off (or Note On with velocity 0) releases it. Only mapped
// notes produce output, and any Key kind is allowed, so a pad or piano key
// can become a shortcut, a media key, or a virtual key to remap/layer later.
//
// Messages arrive as onMidiMessage (EspUsbHost 2.3.0). Every channel is
// listened to by default; setChannel() narrows it to one. Only note on/off
// are used - control changes, pitch bend, etc. are ignored in this version.
class EspUsbHostMidiInputAdapter : public InputAdapter
{
public:
  explicit EspUsbHostMidiInputAdapter(EspUsbHost &usb) : usb_(usb) {}

  // Map a MIDI note (0-127) to any Key. Returns false if the note is out of
  // range; unmapped notes produce nothing.
  bool mapNote(uint8_t note, Key key)
  {
    if (note > 127)
    {
      return false;
    }
    noteKeys_[note] = key;
    return true;
  }

  // Listen to one MIDI channel (0-15), or all channels with -1 (default).
  void setChannel(int channel = -1) { channel_ = channel; }

  void update() override
  {
    if (!subscribed_)
    {
      subscribed_ = true;
      detail::EspUsbHostHub &hub = detail::EspUsbHostHub::forStack(usb_);
      hub.setMidiSink(&EspUsbHostMidiInputAdapter::handleMidi, this);
      hub.addDisconnectSink(&EspUsbHostMidiInputAdapter::handleDisconnect, this);
    }

    uint8_t onNotes[16];
    size_t deviceCount;
    portENTER_CRITICAL(&mux_);
    memcpy(onNotes, onNotes_, sizeof(onNotes));
    deviceCount = deviceCount_;
    portEXIT_CRITICAL(&mux_);

    keys_.clear();
    for (size_t note = 0; note < 128; ++note)
    {
      if ((onNotes[note >> 3] & (1u << (note & 7))) != 0 && isValid(noteKeys_[note]))
      {
        keys_.press(noteKeys_[note]);
      }
    }
    connected_ = deviceCount > 0;
  }

  const KeySet &keys() const override { return keys_; }
  bool connected() const override { return connected_; }

private:
  static constexpr size_t MaxDevices = 4;

  // Fires from the EspUsbHost task.
  static void handleMidi(void *context, const EspUsbHostMidiMessage &message)
  {
    EspUsbHostMidiInputAdapter &self = *static_cast<EspUsbHostMidiInputAdapter *>(context);
    const uint8_t type = message.status & 0xf0;
    const uint8_t channel = message.status & 0x0f;
    const bool noteOn = (type == 0x90) && (message.data2 > 0);
    const bool noteOff = (type == 0x80) || ((type == 0x90) && (message.data2 == 0));

    portENTER_CRITICAL(&self.mux_);
    // Track the device for presence (and clearing stuck notes on unplug).
    bool known = false;
    for (size_t i = 0; i < self.deviceCount_; ++i)
    {
      if (self.devices_[i] == message.address)
      {
        known = true;
        break;
      }
    }
    if (!known && self.deviceCount_ < MaxDevices)
    {
      self.devices_[self.deviceCount_++] = message.address;
    }

    if ((self.channel_ < 0 || channel == self.channel_) && (noteOn || noteOff))
    {
      const uint8_t note = message.data1 & 0x7f;
      if (noteOn)
      {
        self.onNotes_[note >> 3] |= static_cast<uint8_t>(1u << (note & 7));
      }
      else
      {
        self.onNotes_[note >> 3] &= static_cast<uint8_t>(~(1u << (note & 7)));
      }
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  // Fires from the EspUsbHost task (any device, not only MIDI).
  static void handleDisconnect(void *context, uint8_t address)
  {
    EspUsbHostMidiInputAdapter &self = *static_cast<EspUsbHostMidiInputAdapter *>(context);
    portENTER_CRITICAL(&self.mux_);
    for (size_t i = self.deviceCount_; i > 0; --i)
    {
      if (self.devices_[i - 1] == address)
      {
        self.devices_[i - 1] = self.devices_[self.deviceCount_ - 1];
        --self.deviceCount_;
      }
    }
    // No MIDI device left: drop any notes still marked on, so they do not
    // reappear when a device is plugged back in.
    if (self.deviceCount_ == 0)
    {
      memset(self.onNotes_, 0, sizeof(self.onNotes_));
    }
    portEXIT_CRITICAL(&self.mux_);
  }

  EspUsbHost &usb_;
  bool subscribed_ = false;
  KeySet keys_;
  bool connected_ = false;
  int channel_ = -1;
  Key noteKeys_[128] = {};
  uint8_t onNotes_[16] = {};
  portMUX_TYPE mux_ = portMUX_INITIALIZER_UNLOCKED;
  uint8_t devices_[MaxDevices] = {};
  size_t deviceCount_ = 0;
};

} // namespace esp32keybridge
